spriteJson.game2_brain = {"file":"brain.png","frames":{
    "脑子_00000":{"x":348,"y":336,"w":77,"h":88,"offX":105,"offY":677,"sourceW":700,"sourceH":1140},
    "脑子_00002":{"x":262,"y":336,"w":84,"h":115,"offX":105,"offY":650,"sourceW":700,"sourceH":1140},
    "脑子_00004":{"x":90,"y":336,"w":84,"h":142,"offX":105,"offY":623,"sourceW":700,"sourceH":1140},
    "脑子_00006":{"x":226,"y":0,"w":112,"h":169,"offX":97,"offY":596,"sourceW":700,"sourceH":1140},
    "脑子_00008":{"x":0,"y":0,"w":114,"h":168,"offX":96,"offY":597,"sourceW":700,"sourceH":1140},
    "脑子_00010":{"x":226,"y":171,"w":92,"h":157,"offX":97,"offY":608,"sourceW":700,"sourceH":1140},
    "脑子_00012":{"x":340,"y":0,"w":103,"h":177,"offX":100,"offY":588,"sourceW":700,"sourceH":1140},
    "脑子_00014":{"x":116,"y":0,"w":108,"h":177,"offX":103,"offY":588,"sourceW":700,"sourceH":1140},
    "脑子_00016":{"x":0,"y":170,"w":88,"h":176,"offX":105,"offY":589,"sourceW":700,"sourceH":1140},
    "脑子_00018":{"x":320,"y":179,"w":84,"h":155,"offX":105,"offY":610,"sourceW":700,"sourceH":1140},
    "脑子_00020":{"x":90,"y":179,"w":84,"h":155,"offX":105,"offY":610,"sourceW":700,"sourceH":1140},
    "脑子_00022":{"x":176,"y":330,"w":84,"h":155,"offX":105,"offY":610,"sourceW":700,"sourceH":1140},
    "脑子_00024":{"x":406,"y":179,"w":84,"h":155,"offX":105,"offY":610,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_camera = {"file":"camera.png","frames":{
    "照相机_00000":{"x":0,"y":893,"w":113,"h":39,"offX":75,"offY":868,"sourceW":700,"sourceH":1140},
    "照相机_00002":{"x":0,"y":852,"w":113,"h":39,"offX":75,"offY":850,"sourceW":700,"sourceH":1140},
    "照相机_00004":{"x":243,"y":755,"w":144,"h":144,"offX":74,"offY":781,"sourceW":700,"sourceH":1140},
    "照相机_00006":{"x":0,"y":0,"w":286,"h":144,"offX":4,"offY":773,"sourceW":700,"sourceH":1140},
    "照相机_00008":{"x":389,"y":755,"w":121,"h":164,"offX":73,"offY":806,"sourceW":700,"sourceH":1140},
    "照相机_00010":{"x":120,"y":802,"w":117,"h":163,"offX":71,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00012":{"x":0,"y":665,"w":118,"h":185,"offX":70,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00014":{"x":122,"y":600,"w":119,"h":200,"offX":69,"offY":832,"sourceW":700,"sourceH":1140},
    "照相机_00016":{"x":357,"y":551,"w":119,"h":202,"offX":69,"offY":832,"sourceW":700,"sourceH":1140},
    "照相机_00018":{"x":0,"y":455,"w":120,"h":208,"offX":68,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00020":{"x":357,"y":309,"w":120,"h":240,"offX":68,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00022":{"x":235,"y":309,"w":120,"h":289,"offX":68,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00024":{"x":288,"y":0,"w":122,"h":307,"offX":66,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00026":{"x":0,"y":146,"w":118,"h":307,"offX":70,"offY":833,"sourceW":700,"sourceH":1140},
    "照相机_00028":{"x":120,"y":146,"w":113,"h":307,"offX":75,"offY":833,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_curtain = {"file":"curtain.png","frames":{
    "布帘_00000":{"x":165,"y":295,"w":164,"h":293,"offX":493,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00002":{"x":165,"y":0,"w":164,"h":293,"offX":493,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00004":{"x":0,"y":297,"w":162,"h":294,"offX":496,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00006":{"x":0,"y":0,"w":163,"h":295,"offX":494,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00008":{"x":164,"y":590,"w":161,"h":295,"offX":495,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00010":{"x":331,"y":0,"w":159,"h":295,"offX":495,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00012":{"x":0,"y":593,"w":160,"h":294,"offX":494,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00014":{"x":489,"y":590,"w":160,"h":294,"offX":494,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00016":{"x":327,"y":590,"w":160,"h":294,"offX":495,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00018":{"x":652,"y":0,"w":158,"h":295,"offX":496,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00020":{"x":651,"y":297,"w":158,"h":295,"offX":496,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00022":{"x":492,"y":0,"w":158,"h":295,"offX":496,"offY":313,"sourceW":700,"sourceH":1140},
    "布帘_00024":{"x":651,"y":594,"w":158,"h":294,"offX":496,"offY":313,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_door = {"file":"door.png","frames":{
    "开门_00000":{"x":0,"y":0,"w":85,"h":189,"offX":350,"offY":951,"sourceW":700,"sourceH":1140},
    "开门_00002":{"x":237,"y":0,"w":63,"h":188,"offX":351,"offY":952,"sourceW":700,"sourceH":1140},
    "开门_00004":{"x":58,"y":191,"w":21,"h":187,"offX":337,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00006":{"x":87,"y":0,"w":79,"h":187,"offX":276,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00008":{"x":168,"y":0,"w":67,"h":187,"offX":289,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00010":{"x":360,"y":0,"w":52,"h":187,"offX":305,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00012":{"x":319,"y":189,"w":54,"h":187,"offX":303,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00014":{"x":0,"y":191,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00016":{"x":87,"y":189,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00018":{"x":302,"y":0,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00020":{"x":261,"y":190,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00022":{"x":203,"y":190,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140},
    "开门_00024":{"x":145,"y":189,"w":56,"h":187,"offX":301,"offY":953,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_drawer = {"file":"drawer.png","frames":{
    "抽屉打开_00000":{"x":793,"y":1289,"w":204,"h":424,"offX":496,"offY":58,"sourceW":700,"sourceH":1140},
    "抽屉打开_00002":{"x":226,"y":1319,"w":204,"h":422,"offX":496,"offY":58,"sourceW":700,"sourceH":1140},
    "抽屉打开_00004":{"x":0,"y":1352,"w":204,"h":420,"offX":496,"offY":58,"sourceW":700,"sourceH":1140},
    "抽屉打开_00006":{"x":0,"y":933,"w":224,"h":417,"offX":476,"offY":72,"sourceW":700,"sourceH":1140},
    "抽屉打开_00008":{"x":528,"y":1289,"w":263,"h":401,"offX":437,"offY":100,"sourceW":700,"sourceH":1140},
    "抽屉打开_00010":{"x":606,"y":900,"w":302,"h":387,"offX":398,"offY":119,"sourceW":700,"sourceH":1140},
    "抽屉打开_00012":{"x":256,"y":901,"w":270,"h":416,"offX":381,"offY":90,"sourceW":700,"sourceH":1140},
    "抽屉打开_00014":{"x":0,"y":461,"w":254,"h":470,"offX":397,"offY":36,"sourceW":700,"sourceH":1140},
    "抽屉打开_00016":{"x":0,"y":0,"w":300,"h":459,"offX":400,"offY":47,"sourceW":700,"sourceH":1140},
    "抽屉打开_00018":{"x":606,"y":451,"w":302,"h":447,"offX":398,"offY":59,"sourceW":700,"sourceH":1140},
    "抽屉打开_00020":{"x":302,"y":451,"w":302,"h":448,"offX":398,"offY":58,"sourceW":700,"sourceH":1140},
    "抽屉打开_00022":{"x":302,"y":0,"w":302,"h":449,"offX":398,"offY":57,"sourceW":700,"sourceH":1140},
    "抽屉打开_00024":{"x":606,"y":0,"w":302,"h":449,"offX":398,"offY":57,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_eye = {"file":"eye.png","frames":{
    "眼球_00000":{"x":309,"y":76,"w":75,"h":74,"offX":119,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00002":{"x":78,"y":0,"w":76,"h":74,"offX":119,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00004":{"x":0,"y":152,"w":76,"h":74,"offX":119,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00006":{"x":0,"y":76,"w":76,"h":74,"offX":119,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00008":{"x":0,"y":0,"w":76,"h":74,"offX":119,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00010":{"x":156,"y":0,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00012":{"x":155,"y":76,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00014":{"x":78,"y":152,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00016":{"x":78,"y":76,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00018":{"x":232,"y":152,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00020":{"x":232,"y":76,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00022":{"x":155,"y":152,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140},
    "眼球_00024":{"x":233,"y":0,"w":75,"h":74,"offX":120,"offY":74,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_gamedoor = {"file":"gamedoor.png","frames":{
    "门开启_00000":{"x":1023,"y":0,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00002":{"x":1219,"y":678,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00004":{"x":1009,"y":678,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00006":{"x":1009,"y":378,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00008":{"x":799,"y":678,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00010":{"x":799,"y":378,"w":208,"h":298,"offX":235,"offY":434,"sourceW":700,"sourceH":1140},
    "门开启_00012":{"x":407,"y":301,"w":207,"h":348,"offX":236,"offY":411,"sourceW":700,"sourceH":1140},
    "门开启_00014":{"x":793,"y":0,"w":228,"h":376,"offX":210,"offY":398,"sourceW":700,"sourceH":1140},
    "门开启_00016":{"x":0,"y":0,"w":386,"h":350,"offX":52,"offY":410,"sourceW":700,"sourceH":1140},
    "门开启_00018":{"x":0,"y":352,"w":405,"h":299,"offX":33,"offY":433,"sourceW":700,"sourceH":1140},
    "门开启_00020":{"x":402,"y":653,"w":395,"h":299,"offX":43,"offY":433,"sourceW":700,"sourceH":1140},
    "门开启_00022":{"x":0,"y":653,"w":400,"h":299,"offX":38,"offY":433,"sourceW":700,"sourceH":1140},
    "门开启_00024":{"x":388,"y":0,"w":403,"h":299,"offX":35,"offY":433,"sourceW":700,"sourceH":1140}}}

spriteJson.game2_glass = {"file":"glass.png","frames":{
    "放大镜_00000":{"x":1190,"y":305,"w":131,"h":256,"offX":300,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00002":{"x":1323,"y":305,"w":127,"h":256,"offX":290,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00004":{"x":1018,"y":305,"w":170,"h":287,"offX":231,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00006":{"x":816,"y":305,"w":200,"h":303,"offX":185,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00008":{"x":578,"y":305,"w":236,"h":303,"offX":135,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00010":{"x":304,"y":305,"w":272,"h":303,"offX":86,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00012":{"x":0,"y":305,"w":302,"h":303,"offX":46,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00014":{"x":1615,"y":0,"w":319,"h":303,"offX":23,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00016":{"x":1292,"y":0,"w":321,"h":303,"offX":20,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00018":{"x":969,"y":0,"w":321,"h":303,"offX":20,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00020":{"x":646,"y":0,"w":321,"h":303,"offX":20,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00022":{"x":323,"y":0,"w":321,"h":303,"offX":20,"offY":92,"sourceW":700,"sourceH":1140},
    "放大镜_00024":{"x":0,"y":0,"w":321,"h":303,"offX":20,"offY":92,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_heart = {"file":"heart.png","frames":{
    "心脏_00000":{"x":276,"y":152,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00002":{"x":184,"y":152,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00004":{"x":92,"y":152,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00006":{"x":0,"y":78,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00008":{"x":368,"y":76,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00010":{"x":276,"y":76,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00012":{"x":0,"y":0,"w":90,"h":76,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00014":{"x":92,"y":76,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00016":{"x":368,"y":0,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00018":{"x":276,"y":0,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00020":{"x":184,"y":0,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00022":{"x":92,"y":0,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140},
    "心脏_00024":{"x":184,"y":76,"w":90,"h":74,"offX":198,"offY":984,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_key = {"file":"key.png","frames":{
    "钥匙_00000":{"x":618,"y":0,"w":200,"h":524,"offX":465,"offY":616,"sourceW":700,"sourceH":1140},
    "钥匙_00002":{"x":206,"y":0,"w":204,"h":525,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00004":{"x":0,"y":0,"w":204,"h":525,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00006":{"x":412,"y":0,"w":204,"h":518,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00008":{"x":0,"y":527,"w":204,"h":470,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00010":{"x":206,"y":1471,"w":208,"h":455,"offX":457,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00012":{"x":0,"y":999,"w":204,"h":463,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00014":{"x":206,"y":999,"w":204,"h":470,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00016":{"x":618,"y":526,"w":204,"h":471,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00018":{"x":412,"y":520,"w":204,"h":471,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00020":{"x":206,"y":527,"w":204,"h":470,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00022":{"x":0,"y":1465,"w":204,"h":470,"offX":461,"offY":615,"sourceW":700,"sourceH":1140},
    "钥匙_00024":{"x":412,"y":993,"w":204,"h":470,"offX":461,"offY":615,"sourceW":700,"sourceH":1140}}}


spriteJson.game2_tv = {"file":"tv.png","frames":{
    "电视_00000":{"x":390,"y":294,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00002":{"x":195,"y":294,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00004":{"x":0,"y":294,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00006":{"x":780,"y":147,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00008":{"x":585,"y":147,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00010":{"x":390,"y":147,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00012":{"x":195,"y":147,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00014":{"x":0,"y":147,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00016":{"x":780,"y":0,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00018":{"x":585,"y":0,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00020":{"x":390,"y":0,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00022":{"x":195,"y":0,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140},
    "电视_00024":{"x":0,"y":0,"w":193,"h":145,"offX":237,"offY":771,"sourceW":700,"sourceH":1140}}}
