var spriteJson = {};

spriteJson.game1_book1 = {"file":"book1.png","frames":{
    "100000":{"x":193,"y":162,"w":100,"h":142,"offX":406,"offY":66,"sourceW":700,"sourceH":1140},
    "100002":{"x":0,"y":166,"w":96,"h":150,"offX":406,"offY":63,"sourceW":700,"sourceH":1140},
    "100004":{"x":100,"y":162,"w":91,"h":161,"offX":406,"offY":64,"sourceW":700,"sourceH":1140},
    "100006":{"x":0,"y":0,"w":98,"h":164,"offX":403,"offY":66,"sourceW":700,"sourceH":1140},
    "100008":{"x":193,"y":306,"w":81,"h":164,"offX":385,"offY":66,"sourceW":700,"sourceH":1140},
    "100010":{"x":100,"y":0,"w":95,"h":160,"offX":343,"offY":66,"sourceW":700,"sourceH":1140},
    "100012":{"x":0,"y":318,"w":81,"h":165,"offX":329,"offY":66,"sourceW":700,"sourceH":1140},
    "100014":{"x":276,"y":306,"w":68,"h":161,"offX":342,"offY":66,"sourceW":700,"sourceH":1140},
    "100016":{"x":364,"y":0,"w":65,"h":162,"offX":345,"offY":66,"sourceW":700,"sourceH":1140},
    "100018":{"x":346,"y":306,"w":67,"h":163,"offX":343,"offY":66,"sourceW":700,"sourceH":1140},
    "100020":{"x":83,"y":325,"w":67,"h":164,"offX":343,"offY":66,"sourceW":700,"sourceH":1140},
    "100022":{"x":415,"y":306,"w":67,"h":163,"offX":343,"offY":66,"sourceW":700,"sourceH":1140},
    "100024":{"x":295,"y":0,"w":67,"h":163,"offX":343,"offY":66,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_book2 = {"file":"book2.png","frames":{
    "200000":{"x":102,"y":160,"w":111,"h":148,"offX":544,"offY":61,"sourceW":700,"sourceH":1140},
    "200002":{"x":102,"y":0,"w":104,"h":158,"offX":545,"offY":61,"sourceW":700,"sourceH":1140},
    "200004":{"x":0,"y":170,"w":95,"h":167,"offX":547,"offY":61,"sourceW":700,"sourceH":1140},
    "200006":{"x":0,"y":0,"w":100,"h":168,"offX":546,"offY":66,"sourceW":700,"sourceH":1140},
    "200008":{"x":180,"y":310,"w":69,"h":168,"offX":542,"offY":65,"sourceW":700,"sourceH":1140},
    "200010":{"x":97,"y":310,"w":81,"h":170,"offX":502,"offY":66,"sourceW":700,"sourceH":1140},
    "200012":{"x":0,"y":339,"w":69,"h":168,"offX":486,"offY":66,"sourceW":700,"sourceH":1140},
    "200014":{"x":251,"y":310,"w":56,"h":170,"offX":499,"offY":66,"sourceW":700,"sourceH":1140},
    "200016":{"x":364,"y":171,"w":50,"h":170,"offX":505,"offY":66,"sourceW":700,"sourceH":1140},
    "200018":{"x":325,"y":0,"w":53,"h":169,"offX":502,"offY":66,"sourceW":700,"sourceH":1140},
    "200020":{"x":309,"y":310,"w":53,"h":170,"offX":502,"offY":66,"sourceW":700,"sourceH":1140},
    "200022":{"x":270,"y":0,"w":53,"h":170,"offX":502,"offY":66,"sourceW":700,"sourceH":1140},
    "200024":{"x":215,"y":0,"w":53,"h":170,"offX":502,"offY":66,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_book3 = {"file":"book3.png","frames":{
    "300000":{"x":0,"y":198,"w":108,"h":150,"offX":399,"offY":256,"sourceW":700,"sourceH":1140},
    "300002":{"x":221,"y":188,"w":105,"h":167,"offX":400,"offY":256,"sourceW":700,"sourceH":1140},
    "300004":{"x":221,"y":0,"w":105,"h":186,"offX":400,"offY":256,"sourceW":700,"sourceH":1140},
    "300006":{"x":0,"y":0,"w":109,"h":196,"offX":400,"offY":259,"sourceW":700,"sourceH":1140},
    "300008":{"x":328,"y":0,"w":91,"h":199,"offX":380,"offY":259,"sourceW":700,"sourceH":1140},
    "300010":{"x":111,"y":0,"w":108,"h":191,"offX":333,"offY":259,"sourceW":700,"sourceH":1140},
    "300012":{"x":111,"y":193,"w":94,"h":184,"offX":317,"offY":259,"sourceW":700,"sourceH":1140},
    "300014":{"x":421,"y":193,"w":79,"h":190,"offX":332,"offY":259,"sourceW":700,"sourceH":1140},
    "300016":{"x":80,"y":379,"w":76,"h":192,"offX":335,"offY":259,"sourceW":700,"sourceH":1140},
    "300018":{"x":328,"y":201,"w":78,"h":191,"offX":333,"offY":259,"sourceW":700,"sourceH":1140},
    "300020":{"x":421,"y":0,"w":79,"h":191,"offX":332,"offY":259,"sourceW":700,"sourceH":1140},
    "300022":{"x":0,"y":350,"w":78,"h":191,"offX":333,"offY":259,"sourceW":700,"sourceH":1140},
    "300024":{"x":207,"y":357,"w":78,"h":191,"offX":333,"offY":259,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_bookshow = {"file":"bookshow.png","frames":{
    "书拿出来00000":{"x":245,"y":132,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "书拿出来00002":{"x":947,"y":128,"w":68,"h":140,"offX":47,"offY":699,"sourceW":700,"sourceH":1140},
    "书拿出来00004":{"x":245,"y":256,"w":144,"h":143,"offX":47,"offY":699,"sourceW":700,"sourceH":1140},
    "书拿出来00006":{"x":741,"y":128,"w":204,"h":143,"offX":47,"offY":699,"sourceW":700,"sourceH":1140},
    "书拿出来00008":{"x":498,"y":128,"w":241,"h":126,"offX":47,"offY":718,"sourceW":700,"sourceH":1140},
    "书拿出来00010":{"x":0,"y":0,"w":251,"h":130,"offX":47,"offY":720,"sourceW":700,"sourceH":1140},
    "书拿出来00012":{"x":253,"y":128,"w":243,"h":126,"offX":47,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00014":{"x":743,"y":0,"w":243,"h":126,"offX":47,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00016":{"x":498,"y":0,"w":243,"h":126,"offX":47,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00018":{"x":253,"y":0,"w":243,"h":126,"offX":47,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00020":{"x":0,"y":132,"w":243,"h":126,"offX":47,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00022":{"x":0,"y":260,"w":95,"h":126,"offX":195,"offY":719,"sourceW":700,"sourceH":1140},
    "书拿出来00024":{"x":97,"y":260,"w":95,"h":126,"offX":195,"offY":719,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_clothes = {"file":"clothes.png","frames":{
    "主体00000":{"x":1979,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "主体00002":{"x":1972,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "主体00004":{"x":1965,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "主体00006":{"x":1717,"y":1521,"w":239,"h":194,"offX":217,"offY":468,"sourceW":700,"sourceH":1140},
    "主体00008":{"x":1717,"y":1281,"w":255,"h":238,"offX":216,"offY":467,"sourceW":700,"sourceH":1140},
    "主体00010":{"x":1451,"y":1281,"w":264,"h":295,"offX":207,"offY":460,"sourceW":700,"sourceH":1140},
    "主体00012":{"x":0,"y":1262,"w":282,"h":310,"offX":202,"offY":450,"sourceW":700,"sourceH":1140},
    "主体00014":{"x":375,"y":1257,"w":301,"h":322,"offX":207,"offY":440,"sourceW":700,"sourceH":1140},
    "主体00016":{"x":1133,"y":1245,"w":316,"h":334,"offX":209,"offY":428,"sourceW":700,"sourceH":1140},
    "主体00018":{"x":1133,"y":894,"w":341,"h":349,"offX":209,"offY":413,"sourceW":700,"sourceH":1140},
    "主体00020":{"x":375,"y":890,"w":363,"h":365,"offX":209,"offY":397,"sourceW":700,"sourceH":1140},
    "主体00022":{"x":0,"y":879,"w":373,"h":381,"offX":209,"offY":381,"sourceW":700,"sourceH":1140},
    "主体00024":{"x":752,"y":877,"w":379,"h":396,"offX":209,"offY":366,"sourceW":700,"sourceH":1140},
    "主体00026":{"x":813,"y":466,"w":381,"h":409,"offX":209,"offY":353,"sourceW":700,"sourceH":1140},
    "主体00028":{"x":0,"y":456,"w":379,"h":421,"offX":209,"offY":341,"sourceW":700,"sourceH":1140},
    "主体00030":{"x":1595,"y":439,"w":376,"h":427,"offX":209,"offY":335,"sourceW":700,"sourceH":1140},
    "主体00032":{"x":1573,"y":868,"w":374,"h":411,"offX":209,"offY":351,"sourceW":700,"sourceH":1140},
    "主体00034":{"x":381,"y":468,"w":369,"h":420,"offX":209,"offY":342,"sourceW":700,"sourceH":1140},
    "主体00036":{"x":1595,"y":0,"w":368,"h":437,"offX":209,"offY":325,"sourceW":700,"sourceH":1140},
    "主体00038":{"x":1205,"y":0,"w":388,"h":453,"offX":209,"offY":309,"sourceW":700,"sourceH":1140},
    "主体00040":{"x":414,"y":0,"w":397,"h":466,"offX":209,"offY":296,"sourceW":700,"sourceH":1140},
    "主体00042":{"x":0,"y":0,"w":412,"h":454,"offX":209,"offY":308,"sourceW":700,"sourceH":1140},
    "主体00044":{"x":813,"y":0,"w":390,"h":464,"offX":209,"offY":298,"sourceW":700,"sourceH":1140},
    "主体00046":{"x":1205,"y":455,"w":366,"h":437,"offX":209,"offY":325,"sourceW":700,"sourceH":1140},
    "主体00048":{"x":678,"y":1275,"w":292,"h":296,"offX":209,"offY":466,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_draw = {"file":"draw.png","frames":{
    "墙上的画00000":{"x":369,"y":634,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00002":{"x":492,"y":0,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00004":{"x":369,"y":317,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00006":{"x":246,"y":634,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00008":{"x":369,"y":0,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00010":{"x":246,"y":317,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00012":{"x":123,"y":634,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00014":{"x":246,"y":0,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00016":{"x":123,"y":317,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00018":{"x":0,"y":634,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00020":{"x":123,"y":0,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00022":{"x":0,"y":317,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140},
    "墙上的画00024":{"x":0,"y":0,"w":121,"h":315,"offX":193,"offY":277,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_brain = {"file":"brain.png","frames":{
    "脑壳_00000":{"x":0,"y":152,"w":73,"h":35,"offX":583,"offY":291,"sourceW":700,"sourceH":1140},
    "脑壳_00002":{"x":150,"y":114,"w":73,"h":36,"offX":583,"offY":277,"sourceW":700,"sourceH":1140},
    "脑壳_00004":{"x":75,"y":114,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00006":{"x":0,"y":114,"w":73,"h":36,"offX":583,"offY":257,"sourceW":700,"sourceH":1140},
    "脑壳_00008":{"x":150,"y":76,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00010":{"x":75,"y":76,"w":73,"h":36,"offX":583,"offY":264,"sourceW":700,"sourceH":1140},
    "脑壳_00012":{"x":0,"y":76,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00014":{"x":150,"y":38,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00016":{"x":75,"y":38,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00018":{"x":0,"y":38,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00020":{"x":150,"y":0,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00022":{"x":75,"y":0,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140},
    "脑壳_00024":{"x":0,"y":0,"w":73,"h":36,"offX":583,"offY":263,"sourceW":700,"sourceH":1140}}}

spriteJson.game1_drawer = {"file":"drawer.png","frames":{
    "抽屉弹出00000":{"x":549,"y":651,"w":227,"h":85,"offX":208,"offY":860,"sourceW":700,"sourceH":1140},
    "抽屉弹出00002":{"x":549,"y":550,"w":245,"h":99,"offX":190,"offY":860,"sourceW":700,"sourceH":1140},
    "抽屉弹出00004":{"x":284,"y":550,"w":263,"h":112,"offX":172,"offY":860,"sourceW":700,"sourceH":1140},
    "抽屉弹出00006":{"x":0,"y":375,"w":280,"h":125,"offX":155,"offY":860,"sourceW":700,"sourceH":1140},
    "抽屉弹出00008":{"x":0,"y":550,"w":282,"h":131,"offX":147,"offY":860,"sourceW":700,"sourceH":1140},
    "抽屉弹出00010":{"x":0,"y":0,"w":281,"h":195,"offX":154,"offY":791,"sourceW":700,"sourceH":1140},
    "抽屉弹出00012":{"x":283,"y":0,"w":280,"h":195,"offX":155,"offY":790,"sourceW":700,"sourceH":1140},
    "抽屉弹出00014":{"x":565,"y":0,"w":280,"h":191,"offX":155,"offY":794,"sourceW":700,"sourceH":1140},
    "抽屉弹出00016":{"x":565,"y":193,"w":281,"h":178,"offX":154,"offY":808,"sourceW":700,"sourceH":1140},
    "抽屉弹出00018":{"x":0,"y":197,"w":281,"h":176,"offX":154,"offY":810,"sourceW":700,"sourceH":1140},
    "抽屉弹出00020":{"x":283,"y":197,"w":280,"h":175,"offX":155,"offY":810,"sourceW":700,"sourceH":1140},
    "抽屉弹出00022":{"x":565,"y":373,"w":280,"h":175,"offX":155,"offY":810,"sourceW":700,"sourceH":1140},
    "抽屉弹出00024":{"x":283,"y":374,"w":280,"h":174,"offX":155,"offY":811,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_flower = {"file":"flower.png","frames":{
    "花打开00000":{"x":1008,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "花打开00002":{"x":994,"y":0,"w":12,"h":27,"offX":497,"offY":967,"sourceW":700,"sourceH":1140},
    "花打开00004":{"x":510,"y":311,"w":31,"h":60,"offX":491,"offY":935,"sourceW":700,"sourceH":1140},
    "花打开00006":{"x":953,"y":309,"w":69,"h":109,"offX":475,"offY":887,"sourceW":700,"sourceH":1140},
    "花打开00008":{"x":381,"y":311,"w":127,"h":192,"offX":440,"offY":804,"sourceW":700,"sourceH":1140},
    "花打开00010":{"x":785,"y":309,"w":166,"h":256,"offX":404,"offY":739,"sourceW":700,"sourceH":1140},
    "花打开00012":{"x":194,"y":309,"w":185,"h":286,"offX":415,"offY":709,"sourceW":700,"sourceH":1140},
    "花打开00014":{"x":590,"y":0,"w":207,"h":287,"offX":424,"offY":709,"sourceW":700,"sourceH":1140},
    "花打开00016":{"x":194,"y":0,"w":199,"h":307,"offX":423,"offY":688,"sourceW":700,"sourceH":1140},
    "花打开00018":{"x":0,"y":0,"w":192,"h":331,"offX":422,"offY":664,"sourceW":700,"sourceH":1140},
    "花打开00020":{"x":395,"y":0,"w":193,"h":309,"offX":422,"offY":686,"sourceW":700,"sourceH":1140},
    "花打开00022":{"x":590,"y":289,"w":193,"h":305,"offX":423,"offY":690,"sourceW":700,"sourceH":1140},
    "花打开00024":{"x":799,"y":0,"w":193,"h":307,"offX":423,"offY":688,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_glass1 = {"file":"glass1.png","frames":{
    "放大镜-100000":{"x":1017,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "放大镜-100002":{"x":211,"y":455,"w":103,"h":113,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-100004":{"x":0,"y":455,"w":209,"h":162,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-100006":{"x":336,"y":0,"w":292,"h":170,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-100008":{"x":0,"y":0,"w":334,"h":156,"offX":47,"offY":449,"sourceW":700,"sourceH":1140},
    "放大镜-100010":{"x":0,"y":314,"w":337,"h":139,"offX":49,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-100012":{"x":677,"y":426,"w":338,"h":133,"offX":47,"offY":458,"sourceW":700,"sourceH":1140},
    "放大镜-100014":{"x":339,"y":426,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-100016":{"x":630,"y":0,"w":336,"h":141,"offX":47,"offY":455,"sourceW":700,"sourceH":1140},
    "放大镜-100018":{"x":630,"y":143,"w":336,"h":140,"offX":47,"offY":455,"sourceW":700,"sourceH":1140},
    "放大镜-100020":{"x":677,"y":285,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-100022":{"x":339,"y":285,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-100024":{"x":0,"y":172,"w":336,"h":140,"offX":47,"offY":455,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_glass2 = {"file":"glass2.png","frames":{
    "放大镜-200000":{"x":1017,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "放大镜-200002":{"x":211,"y":455,"w":103,"h":113,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-200004":{"x":0,"y":455,"w":209,"h":162,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-200006":{"x":336,"y":0,"w":292,"h":170,"offX":47,"offY":444,"sourceW":700,"sourceH":1140},
    "放大镜-200008":{"x":0,"y":0,"w":334,"h":156,"offX":47,"offY":449,"sourceW":700,"sourceH":1140},
    "放大镜-200010":{"x":0,"y":314,"w":337,"h":139,"offX":49,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-200012":{"x":677,"y":426,"w":338,"h":133,"offX":47,"offY":458,"sourceW":700,"sourceH":1140},
    "放大镜-200014":{"x":339,"y":426,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-200016":{"x":630,"y":0,"w":336,"h":141,"offX":47,"offY":455,"sourceW":700,"sourceH":1140},
    "放大镜-200018":{"x":630,"y":143,"w":336,"h":140,"offX":47,"offY":455,"sourceW":700,"sourceH":1140},
    "放大镜-200020":{"x":677,"y":285,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-200022":{"x":339,"y":285,"w":336,"h":139,"offX":47,"offY":456,"sourceW":700,"sourceH":1140},
    "放大镜-200024":{"x":0,"y":172,"w":336,"h":140,"offX":47,"offY":455,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_rocket = {"file":"rocket.png","frames":{
    "火箭00000":{"x":882,"y":480,"w":47,"h":94,"offX":197,"offY":601,"sourceW":700,"sourceH":1140},
    "火箭00002":{"x":931,"y":384,"w":47,"h":94,"offX":197,"offY":601,"sourceW":700,"sourceH":1140},
    "火箭00004":{"x":882,"y":384,"w":47,"h":94,"offX":198,"offY":598,"sourceW":700,"sourceH":1140},
    "火箭00006":{"x":931,"y":480,"w":46,"h":93,"offX":196,"offY":598,"sourceW":700,"sourceH":1140},
    "火箭00008":{"x":448,"y":509,"w":46,"h":93,"offX":195,"offY":598,"sourceW":700,"sourceH":1140},
    "火箭00010":{"x":579,"y":0,"w":237,"h":381,"offX":62,"offY":248,"sourceW":700,"sourceH":1140},
    "火箭00012":{"x":882,"y":0,"w":99,"h":382,"offX":185,"offY":267,"sourceW":700,"sourceH":1140},
    "火箭00014":{"x":818,"y":0,"w":51,"h":361,"offX":191,"offY":290,"sourceW":700,"sourceH":1140},
    "火箭00016":{"x":294,"y":0,"w":283,"h":507,"offX":45,"offY":234,"sourceW":700,"sourceH":1140},
    "火箭00018":{"x":0,"y":0,"w":292,"h":501,"offX":28,"offY":240,"sourceW":700,"sourceH":1140},
    "火箭00020":{"x":579,"y":383,"w":301,"h":209,"offX":22,"offY":239,"sourceW":700,"sourceH":1140},
    "火箭00022":{"x":222,"y":509,"w":224,"h":210,"offX":105,"offY":239,"sourceW":700,"sourceH":1140},
    "火箭00024":{"x":0,"y":503,"w":220,"h":224,"offX":105,"offY":238,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_sewing = {"file":"sewing.png","frames":{
    "缝纫机00000":{"x":380,"y":374,"w":186,"h":152,"offX":429,"offY":472,"sourceW":700,"sourceH":1140},
    "缝纫机00002":{"x":190,"y":374,"w":188,"h":151,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00004":{"x":0,"y":188,"w":188,"h":169,"offX":429,"offY":472,"sourceW":700,"sourceH":1140},
    "缝纫机00006":{"x":0,"y":359,"w":188,"h":168,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00008":{"x":0,"y":0,"w":188,"h":186,"offX":429,"offY":472,"sourceW":700,"sourceH":1140},
    "缝纫机00010":{"x":566,"y":187,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00012":{"x":378,"y":187,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00014":{"x":190,"y":187,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00016":{"x":754,"y":0,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00018":{"x":566,"y":0,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00020":{"x":378,"y":0,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00022":{"x":190,"y":0,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140},
    "缝纫机00024":{"x":754,"y":187,"w":186,"h":185,"offX":429,"offY":481,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_star = {"file":"star.png","frames":{
    "星空00000":{"x":239,"y":193,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "星空00002":{"x":246,"y":186,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "星空00004":{"x":253,"y":0,"w":1,"h":1,"offX":141,"offY":262,"sourceW":700,"sourceH":1140},
    "星空00006":{"x":95,"y":0,"w":91,"h":164,"offX":51,"offY":99,"sourceW":700,"sourceH":1140},
    "星空00008":{"x":0,"y":0,"w":93,"h":168,"offX":49,"offY":94,"sourceW":700,"sourceH":1140},
    "星空00010":{"x":0,"y":304,"w":95,"h":129,"offX":47,"offY":89,"sourceW":700,"sourceH":1140},
    "星空00012":{"x":95,"y":166,"w":96,"h":136,"offX":46,"offY":86,"sourceW":700,"sourceH":1140},
    "星空00014":{"x":97,"y":304,"w":74,"h":135,"offX":68,"offY":89,"sourceW":700,"sourceH":1140},
    "星空00016":{"x":193,"y":0,"w":58,"h":177,"offX":84,"offY":88,"sourceW":700,"sourceH":1140},
    "星空00018":{"x":193,"y":179,"w":44,"h":102,"offX":84,"offY":163,"sourceW":700,"sourceH":1140},
    "星空00020":{"x":246,"y":179,"w":5,"h":5,"offX":83,"offY":261,"sourceW":700,"sourceH":1140},
    "星空00022":{"x":239,"y":179,"w":5,"h":5,"offX":83,"offY":261,"sourceW":700,"sourceH":1140},
    "星空00024":{"x":239,"y":186,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_ufo = {"file":"ufo.png","frames":{
    "飞碟00000":{"x":953,"y":0,"w":38,"h":44,"offX":0,"offY":35,"sourceW":700,"sourceH":1140},
    "飞碟00002":{"x":945,"y":166,"w":73,"h":64,"offX":0,"offY":55,"sourceW":700,"sourceH":1140},
    "飞碟00004":{"x":890,"y":498,"w":107,"h":94,"offX":0,"offY":66,"sourceW":700,"sourceH":1140},
    "飞碟00006":{"x":702,"y":630,"w":141,"h":111,"offX":0,"offY":85,"sourceW":700,"sourceH":1140},
    "飞碟00008":{"x":702,"y":498,"w":186,"h":130,"offX":0,"offY":101,"sourceW":700,"sourceH":1140},
    "飞碟00010":{"x":709,"y":166,"w":234,"h":164,"offX":0,"offY":102,"sourceW":700,"sourceH":1140},
    "飞碟00012":{"x":0,"y":166,"w":235,"h":164,"offX":0,"offY":103,"sourceW":700,"sourceH":1140},
    "飞碟00014":{"x":0,"y":498,"w":233,"h":163,"offX":0,"offY":105,"sourceW":700,"sourceH":1140},
    "飞碟00016":{"x":235,"y":332,"w":233,"h":164,"offX":0,"offY":104,"sourceW":700,"sourceH":1140},
    "飞碟00018":{"x":716,"y":0,"w":235,"h":164,"offX":0,"offY":102,"sourceW":700,"sourceH":1140},
    "飞碟00020":{"x":473,"y":166,"w":234,"h":164,"offX":0,"offY":103,"sourceW":700,"sourceH":1140},
    "飞碟00022":{"x":470,"y":332,"w":232,"h":164,"offX":0,"offY":104,"sourceW":700,"sourceH":1140},
    "飞碟00024":{"x":0,"y":332,"w":233,"h":164,"offX":0,"offY":105,"sourceW":700,"sourceH":1140},
    "飞碟00026":{"x":468,"y":498,"w":232,"h":163,"offX":0,"offY":103,"sourceW":700,"sourceH":1140},
    "飞碟00028":{"x":235,"y":498,"w":231,"h":164,"offX":0,"offY":102,"sourceW":700,"sourceH":1140},
    "飞碟00030":{"x":704,"y":332,"w":232,"h":164,"offX":0,"offY":102,"sourceW":700,"sourceH":1140},
    "飞碟00032":{"x":237,"y":166,"w":234,"h":164,"offX":0,"offY":105,"sourceW":700,"sourceH":1140},
    "飞碟00034":{"x":478,"y":0,"w":236,"h":164,"offX":0,"offY":108,"sourceW":700,"sourceH":1140},
    "飞碟00036":{"x":239,"y":0,"w":237,"h":164,"offX":0,"offY":106,"sourceW":700,"sourceH":1140},
    "飞碟00038":{"x":0,"y":0,"w":237,"h":164,"offX":0,"offY":105,"sourceW":700,"sourceH":1140}}}


spriteJson.game1_ufo_light = {"file":"ufo_light.png","frames":{
    "飞碟光_00000":{"x":0,"y":1866,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "飞碟光_00002":{"x":1581,"y":0,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "飞碟光_00004":{"x":1332,"y":319,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "飞碟光_00006":{"x":998,"y":914,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "飞碟光_00008":{"x":999,"y":907,"w":5,"h":5,"offX":0,"offY":0,"sourceW":700,"sourceH":1140},
    "飞碟光_00010":{"x":0,"y":1831,"w":33,"h":33,"offX":119,"offY":208,"sourceW":700,"sourceH":1140},
    "飞碟光_00012":{"x":1332,"y":0,"w":247,"h":317,"offX":116,"offY":206,"sourceW":700,"sourceH":1140},
    "飞碟光_00014":{"x":999,"y":457,"w":326,"h":448,"offX":115,"offY":208,"sourceW":700,"sourceH":1140},
    "飞碟光_00016":{"x":333,"y":458,"w":331,"h":456,"offX":114,"offY":207,"sourceW":700,"sourceH":1140},
    "飞碟光_00018":{"x":333,"y":1373,"w":330,"h":456,"offX":117,"offY":205,"sourceW":700,"sourceH":1140},
    "飞碟光_00020":{"x":666,"y":457,"w":331,"h":455,"offX":115,"offY":206,"sourceW":700,"sourceH":1140},
    "飞碟光_00022":{"x":0,"y":916,"w":331,"h":456,"offX":113,"offY":207,"sourceW":700,"sourceH":1140},
    "飞碟光_00024":{"x":333,"y":0,"w":331,"h":456,"offX":114,"offY":208,"sourceW":700,"sourceH":1140},
    "飞碟光_00026":{"x":666,"y":0,"w":331,"h":455,"offX":113,"offY":206,"sourceW":700,"sourceH":1140},
    "飞碟光_00028":{"x":0,"y":458,"w":331,"h":456,"offX":112,"offY":205,"sourceW":700,"sourceH":1140},
    "飞碟光_00030":{"x":666,"y":914,"w":330,"h":456,"offX":114,"offY":205,"sourceW":700,"sourceH":1140},
    "飞碟光_00032":{"x":333,"y":916,"w":331,"h":455,"offX":115,"offY":209,"sourceW":700,"sourceH":1140},
    "飞碟光_00034":{"x":0,"y":1374,"w":331,"h":455,"offX":117,"offY":211,"sourceW":700,"sourceH":1140},
    "飞碟光_00036":{"x":0,"y":0,"w":331,"h":456,"offX":118,"offY":209,"sourceW":700,"sourceH":1140},
    "飞碟光_00038":{"x":999,"y":0,"w":331,"h":455,"offX":118,"offY":209,"sourceW":700,"sourceH":1140}}}